app/controllers/login_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
---
  def resetpassword
    user = User.find_by(id: current_login.user_id)