app/controllers/posts_controller.rb

  def find_post
    @post = Post.find_by(id: params['id'])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]