app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    render json: Post.all

SELECT "posts".* FROM "posts"
---
  def coordinates
    render json: Post.all, each_serializer: ShortPostSerializer

INSERT INTO "posts" ("user_id", "media_type", "media_link", "description", "created_at", "updated_at", "coordinates") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    render json: { 'error': 'missing content' }, status: :bad_request and return unless post_params[:content] != nil
    render json: { 'error': 'wrong coordinates' }, status: :bad_request and return unless valid_coordinates(params[:coordinates]) != nil

    post = find_user(current_login).posts.create(post_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
---
  def find_user(login)
    User.find_by(id: login.user_id)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def find_post
    @post = Post.find_by(id: params[:id])