app/controllers/users_controller.rb

  def create
    user = User.new(user_params)
    new_params = { 'identification': params[:username], 'password': params[:password] }
    if user.save && user.create_login(new_params)
---
INSERT INTO "logins" ("identification", "password_digest", "oauth2_token", "single_use_oauth2_token", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "users" ("email", "username", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "poisson@gmail.com"], ["username", "poisson"], ["created_at", "2018-05-16 11:44:52.523433"], ["updated_at", "2018-05-16 11:44:52.523433"]]